
export const questions = {
    qa: [{
        title: 'איזה בדיקה לא תעשה על אפליקצית וויז?',
        answer: 3,
        options: ['מאתר כתובת קרובה', 'מתריע בפני חסימות בכביש', 'מודיע שאין קליטה', 'יודע לשמור תמונה']
    },
    {
        title: 'מה לא תבדוק בארון קיר',
        answer: 3,
        options: ['שהוא יציב', 'שהדלתות שלו נפתחות בקלות', 'שהוא מכיל את הנפח שאמור להכיל', 'שקל להעביר אותו ממקום למקום ']
    },
    {
        title: 'מה התכונה הכי חשובה של אפליקצית וואטסאפ?',
        answer: 2,
        options: ['שליחת תמונה', 'פתיחת קבוצה', 'שליחת הודעות', 'התנתקות מהמערכת']
    },
    {
        title: 'מזה באג?',
        answer: 0,
        options: ['מצפים לפעולה ובפועל קורה משהו אחר', 'הודעת שגיאה', 'אתחול של המכשיר למצבו המקורי', 'יכולת נוספת של המכשיר לביצוע מטלות חכמות']
    },
    {
        title: 'מה תפקיד הבודק בחברה',
        answer: 2,
        options: ['תמיכה למחשב', 'פיתוח מוצר מאפס', 'איתור תקלות', 'הטמעת מערכות']
    },
    {
        title: 'מה ההבדל בין אפליקציה לאתר',
        answer: 3,
        options: ['שניהם נכתבים בשפות תכנות שונות', 'אתר יכול להפתח רק על דפדפן', 'שניהם צריכים להבדק על ידי איש בדיקות', 'כל התשובות נכונות']
    },
    {
        title: 'מצאת תקלה במוצר. מפתח המוצר ניגש אליך וטען שלא מדובר בתקלה אלא חלק מתפעול תקין של המוצר. מה הכי נכון מבין המשפטים הבאים',
        answer: 1,
        options: ['אתעקש איתו שזו כן תקלה', 'אבדוק קודם אם באמת טעיתי ואז אחזור אליו', 'מדובר במפתח המוצר לכן בטוח שהוא צודק', 'אמחק את הבאג שהזנתי ואמשיך לעבוד']
    },
    {
        title: 'המצב הכי חשוב שכדאי שהמערכות בחברת חשמל יבדקו הוא',
        answer: 3,
        options: ['מזג האויר נוח', 'מזג האויר סוער וקר', 'מזג האויר חם מאד', 'בכל המצבים הנ"ל']
    },
    {
        title: 'במידה שאת/ה מנסה להפעיל אפליקציה בבית והיא לא עובדת את/ה',
        answer: 1,
        options: ['מתייאש/ת ומסיר/ה את האפליקציה', 'מנסה להפעיל אותה שוב בדרך אחרת ', 'לא עושה כלום ועובר/ת לאפליקציה הבאה ', 'מדווח/ת על האפליקציה ליצרנים ']
    },
    {
        title: 'תכונת האופי שהכי מאפיינת אותי מבין הבאות היא',
        answer: 0,
        options: ['יכולת למידה עצמית וירידה לפרטים ', 'חברותי וסתגלן', 'זריז ומהיר', 'סקרן ויסודי ']
    },
    ],
    fullstack: [{
        title: '5+8:2-1 מהי התשובה הנכונה לתרגיל',
        answer: 0,
        options: ['8', '5.5', '5', '9']
    },
    {
        title:
            'CSS is the language we use to style an HTML document.',
        answer: 1,
        options: ['CSS שפה שמשמשת לעיצוב מסמך ה HTML', 'HTMLהינה שפה שמשמשת לעיצוב מסמך ה CSS', 'שפת עיצוב למסמכים חשובים', 'HTML בתוך CSS לא ניתן להגדיר ']
    },
    {
        title: 'We use browser to?',
        answer: 3,
        options: ['Turn on the computer', 'Learn new project', 'Install software', 'Use the internet']
    },
    {
        title: '2X + 44 = 10 * (2+X)',
        answer: 1,
        options: ['x = 6', 'x = 3', 'x = 2', 'x = Error']
    },
    {
        title: '4 / 0.4',
        answer: 3,
        options: ['16', '1.6', '0.1', '10']
    },
    {
        title: 'משאית נוסעת במהירות של 81 קמ"ש, לאיזה מרחק תגיע אחרי 20 דקות',
        answer: 2,
        options: ['30KM', '20KM', '27KM', '40.5KM']
    },
    {
        title: 'If you multiply this number by any other number, the answer will always be the same. What number is this?',
        answer: 0,
        options: ['zero', 'one', 'None', 'two']
    },
    {
        title: 'אתה מנסה להריץ תוכנה שהתקנת פעם ראשונה והיא מחזירה הודעת שגיאה, מה תעשה',
        answer: 1,
        options: ['תמחק את התוכנה ותתקין שוב', 'תקרא את ההודעה ותנסה לתקן את הבעיה', 'ריסטרט למחשב ולהתקין מחדש את התוכנה', 'תחפש תוכנה אחרת לעבוד איתה']
    },
    {
        title: 'What is the next number? 3 12 39 120 ...',
        answer: 2,
        options: ['174', '159', '363', '300']
    },
    {
        title: 'JPG , GIF , PNG',
        answer: 0,
        options: ['סוגים של קבצי תמונה', 'סוגים של קבצי אודיו', 'חברות המשחקים הפופולריות ביותר', 'חברות כרטיסי המסך הפופולריות ביותר']
    }],
    gaming: [{
        title: '5+8:2-1 מהי התשובה הנכונה לתרגיל',
        answer: 0,
        options: ['8', '5.5', '5', '9']
    },
    {
        title:
            'כיצד מחשבים היקף של עיגול',
        answer: 3,
        options: ['R/2+PI', '(R*R)/PI', '2*R', '2*Pi*R']
    },
    {
        title: 'What is C#?',
        answer: 0,
        options: ['Software language', 'Part of Office', 'Kind of Operation System', 'Graphics Card']
    },
    {
        title: '2X + 44 = 10 * (2+X)',
        answer: 1,
        options: ['x = 6', 'x = 3', 'x = 2', 'x = Error']
    },
    {
        title: '4 / 0.4',
        answer: 3,
        options: ['16', '1.6', '0.1', '10']
    },
    {
        title: 'משאית נוסעת במהירות של 81 קמ"ש, לאיזה מרחק תגיע אחרי 20 דקות',
        answer: 2,
        options: ['30KM', '20KM', '27KM', '40.5KM']
    },
    {
        title: 'If you multiply this number by any other number, the answer will always be the same. What number is this?',
        answer: 0,
        options: ['zero', 'one', 'None', 'two']
    },
    {
        title: 'אתה מנסה להריץ תוכנה שהתקנת פעם ראשונה והיא מחזירה הודעת שגיאה, מה תעשה',
        answer: 1,
        options: ['תמחק את התוכנה ותתקין שוב', 'תקרא את ההודעה ותנסה לתקן את הבעיה', 'ריסטרט למחשב ולהתקין מחדש את התוכנה', 'תחפש תוכנה אחרת לעבוד איתה']
    },
    {
        title: 'What is the next number? 3 12 39 120 ...',
        answer: 2,
        options: ['174', '159', '363', '300']
    },
    {
        title: 'JPG , GIF , PNG',
        answer: 0,
        options: ['סוגים של קבצי תמונה', 'סוגים של קבצי אודיו', 'חברות המשחקים הפופולריות ביותר', 'חברות כרטיסי המסך הפופולריות ביותר']
    }],
    cyber: [{
        title: 'In one sentence,what is Linux?',
        answer: 2,
        options: ['Application', 'Web Server', 'Operation System', 'IT Protocol']
    },
    {
        title:
            'What is SOC?',
        answer: 0,
        options: ['Security Operating Center', 'System On Cyber', 'System Operation Cyber', 'Six On C']
    },
    {
        title: 'מהו שרת?',
        answer: 1,
        options: ['מחשב ראשי לביצוע משימות חשובות', 'תוכנה אשר מספקת שירותים למחשבים אחרים', 'מכשיר שנמצא בתוך המחשב לחישובים מהירים', 'חיבור של 3 מחשבים יחד']
    },
    {
        title: '2X + 44 = 10 * (2+X)',
        answer: 1,
        options: ['x = 6', 'x = 3', 'x = 2', 'x = Error']
    },
    {
        title: 'מהו ההבדל בין ראוטר למודם',
        answer: 2,
        options: ['מודם הינו התוכנה של הראוטר שמספק אינטרנט', 'ראוטר ומודם זהים', 'ראוטר הינו מפצל רשתות ומודם מחבר אותנו לאינטרנט', 'ראוטר הינו התוכנה של המודם שמספק אינטרנט']
    },
    {
        title: '(RAM) מהו זכרון פנימי במחשב',
        answer: 0,
        options: ['זכרון המאפשר עבודה מהירה מול המעבד', 'מקום לאחסון תמונות וסרטים', 'תוכנת של ווינדוס לקריאה של דיסקים', 'סוג של תוכנת מחשב']
    },
    {
        title: 'How many digits are there in the binary language?',
        answer: 2,
        options: ['one', 'ten', 'two', 'four']
    },
    {
        title: 'אתה מנסה להריץ תוכנה שהתקנת פעם ראשונה והיא מחזירה הודעת שגיאה, מה תעשה',
        answer: 1,
        options: ['תמחק את התוכנה ותתקין שוב', 'תקרא את ההודעה ותנסה לתקן את הבעיה', 'ריסטרט למחשב ולהתקין מחדש את התוכנה', 'תחפש תוכנה אחרת לעבוד איתה']
    },
    {
        title: 'What is Python?',
        answer: 3,
        options: ['Graphics Card', 'Kind of Operation System', 'Part of Office', 'Software language']
    },
    {
        title: '?IP מהי כתובת',
        answer: 3,
        options: ['חברת התקשורת הפופולרית ביותר', 'ממשק לאבטחת מידע', 'Internet Protocol קיצור של', 'מספר המשמש לזיהוי נקודות קצה (מחשב)']
    }],
    general: {
        test1: [{
            title: 'כיצד היית מדרג את רמת הקריאה וההבנה שלך באנגלית',
        },
        {
            title: 'עד כמה אתה טוב בפתירת שאלות מתמטיות (שאלות הגיון)',
        }
        ],
        test2: [
            {
                title: 'מעניין אותי לפרק מוצר ולדעת כיצד הוא עובד',
                match: ['fullstack']
            },
            {
                title: 'מעניין אותי שפות תכנות',
                match: ['fullstack']
            },
            {
                title: 'נתקלת בבעיה במחשב, חשוב לי להבין לעומק את מקור הבעיה',
                match: ['qa']
            },
            {
                title: 'הורדתי משחק לטלפון, יש בו תקלה קטנה בגרפיקה אבל המשחק עובד, אמשיך לשחק בו',
                match: ['qa']
            },
            {
                title: 'אני גיימר',
                match: ['gaming']
            },
            {
                title: 'נושא האקרים מאוד מעניין אותי',
                match: ['cyber']
            },
            {
                title: 'מעניין אותי לדעת איך האינטרנט עובד',
                match: ['cyber']
            },
        ]
    }

}